src/Documents/СчетФактураПолученный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СчетФактураПолученный</Name>
			<Comment>Счет-фактура полученный</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ОтчетКомитенту</xr:Item>
				<xr:Item>Document.ПоступлениеДопРасходов</xr:Item>
				<xr:Item>Document.ВозвратОтПокупателя</xr:Item>
				<xr:Item>Document.Выписка</xr:Item>
				<xr:Item>Document.ОтчетКомиссионера</xr:Item>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.КорректировкаПоступления</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент от которого мы получили счет-фактуру</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор по которому ведутся взаиморасчеты с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен закупки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхДокНомер</Name>
					<Comment>Номер входящего документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхДокДата</Name>
					<Comment>Дата входящего документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСДокумента</Name>
					<Comment>Сумма НДС документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Comment>Фактический грузоотправитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исправление</Name>
					<Comment>Исправление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсправления</Name>
					<Comment>Номер исправления</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсправляемогоКорректировочногоДокумента</Name>
					<Comment>Номер исправляемого корректировочного документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсправляемогоКорректировочногоДокумента</Name>
					<Comment>Дата исправляемого корректировочного документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходногоДокумента</Name>
					<Comment>Номер исходного документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсходногоДокумента</Name>
					<Comment>Дата исходного документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьИсправлениеИсходногоДокумента</Name>
					<Comment>Учитывать исправление исходного документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсправленияИсходногоДокумента</Name>
					<Comment>Номер исправления исходного документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсправленияИсходногоДокумента</Name>
					<Comment>Дата исправления исходного документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКорректировка</Name>
					<Comment>Есть корректировка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОснование</Name>
					<Comment>Есть основание</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГосударственногоКонтракта</Name>
					<Comment>Идентификатор государственного контракта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Comment>Фактический грузополучатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСпособаВыставления</Name>
					<Comment>Код способа выставления</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованБухгалтером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Товары</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар,услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма всегда без НДС. Сумма всегда равна Цена*Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВсего</Name>
							<Comment>Итоговая сумма по строке документа со всеми налогами</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГТД</Name>
							<Comment>Номер грузовой таможенной декларации (для товаров поступивших по импорту)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ГТДПартийТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ГТДПартийТоваровКомпании</Name>
			<Comment>Блок учета ГТД партий товаров компании собственных и принятых на комиссию</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток товара на складе в разрезе партий</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия, по которой поступил или был взят на комиссию товар</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>Грузовая таможенная декларация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/СчетФактураПолученный/Ext/ObjectModule.bsl
// Модуль документа "Счет фактура полученный"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Выписка".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Выписка(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, 
																											ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Заполнение таблицы приходов
	Состав 			= ДанныеЗаполнения.Состав;
	СписокРасходов 	= Новый ТаблицаЗначений;
	СписокРасходов.Колонки.Добавить("Контрагент",,	"Контрагент",	25);
	СписокРасходов.Колонки.Добавить("Договор",,		"Договор",		25);
	СписокРасходов.Колонки.Добавить("Сумма",,		НСтр("ru = 'Сумма аванса'"),	12);
	СписокРасходов.Колонки.Добавить("СтавкаНДС",,	НСтр("ru = 'Ставка НДС'"),	9);
	СписокРасходов.Колонки.Добавить("СуммаНДС",,	НСтр("ru = 'Сумма НДС'"),	9);
	
	Для Каждого Строка Из Состав Цикл
		
		Если Строка.СуммаРасход > 0 Тогда
			
			СтрокаРасхода 				= СписокРасходов.Добавить();
			СтрокаРасхода.Контрагент 	= Строка.Контрагент;
			СтрокаРасхода.Договор    	= Строка.ДоговорВзаиморасчетов;
			СтрокаРасхода.Сумма      	= Строка.СуммаРасход;
			СтрокаРасхода.СуммаНДС   	= Строка.СуммаНДС;
			СтрокаРасхода.СтавкаНДС  	= Строка.СтавкаНДС;	
			
		КонецЕсли; 
		
	КонецЦикла;  
	
	Если СписокРасходов.Количество() = 0 Тогда  
		ТекстСообщения	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Документ <%1> не содержит авансов.'"),ДанныеЗаполнения);
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, ТекстСообщения);
		Возврат ЛОЖЬ;
	КонецЕсли; 
	
	ЗаполнятьШапку = Истина;
	Если СписокРасходов.Количество() > 1 Тогда  
		ТекстСообщения	= НСтр("ru='Выписка содержит несколько авансов. Необходимо заполнить данные документа вручную.'");
		ВывестиСообщение(ТекстСообщения,ЭтотОбъект);
		ЗаполнятьШапку = Ложь;
	КонецЕсли;
	ВыбСтрока = СписокРасходов[0];
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		НаДату = ТекущаяДатаСеанса();
	Иначе
		НаДату = Дата;
	КонецЕсли; 
	
	// Заполним шапку СФ и одну строку.
	СтрокаТоваров 					= Товары.Добавить();
	СтрокаТоваров.Номенклатура 		= Справочники.Номенклатура.Предоплата;
	СтрокаТоваров.Количество  		= 1;
	СтрокаТоваров.ЕдиницаИзмерения	= СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения;
	СтрокаТоваров.Коэффициент		= СтрокаТоваров.ЕдиницаИзмерения.Коэффициент;
	Документы.СчетФактураПолученный.ТоварыНоменклатураПриИзменении(ЭтотОбъект, СтрокаТоваров, 
																		ДополнительныеСвойства.ПараметрыДействия);
	
	Если ЗаполнятьШапку Тогда
		СтрокаТоваров.Сумма				= ВыбСтрока.Сумма;
		СтрокаТоваров.СтавкаНДС         = ВыбСтрока.СтавкаНДС;
		СтрокаТоваров.СуммаВсего		= ВыбСтрока.Сумма;
		Документы.СчетФактураПолученный.ТоварыСуммаВсегоПриИзменении(ЭтотОбъект, СтрокаТоваров,
																		ДополнительныеСвойства.ПараметрыДействия);
	КонецЕсли;
	
	Если ЗаполнятьШапку Тогда
		Контрагент			  = ВыбСтрока.Контрагент;
		ДоговорВзаиморасчетов  = ВыбСтрока.Договор; 
		ВалютаДокумента		  =	ВыбСтрока.Договор.ВалютаВзаиморасчетов;
	КонецЕсли;
	
	Документы.СчетФактураПолученный.ВалютаДокументаПриИзменении(ЭтотОбъект, 
																	ДополнительныеСвойства.ПараметрыДействия);
	
	СуммаДокумента    				= Товары.Итог("СуммаВсего");
	СуммаНДСДокумента 				= Товары.Итог("СуммаНДС");
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Выписка()

// Производит заполнение объекта на основании документа "Отчет комиссионера".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ОтчетКомиссионера(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения,
																				СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Для отчета комиссионера только 1 строка с комиссионным вознаграждением.
	Товары.Очистить();
	НоваяСтрока					= Товары.Добавить();
	НоваяСтрока.Номенклатура	= Справочники.Номенклатура.КомиссионноеВознаграждение;
	Документы.СчетФактураПолученный.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока, ДополнительныеСвойства.ПараметрыДействия);
	НоваяСтрока.СуммаВсего	= ДанныеЗаполнения.Товары.Итог("Вознаграждение");
	Документы.СчетФактураПолученный.ТоварыСуммаВсегоПриИзменении(ЭтотОбъект, НоваяСтрока, ДополнительныеСвойства.ПараметрыДействия);
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ОтчетКомиссионера()

// Производит заполнение объекта на основании документа "Расходный кассовый ордер".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_РасходныйКассовыйОрдер(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения,
																				СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// При вводе на основании РКО добавляем только одну строку в ТЧ.
	СтрокаТоваров					= Товары.Добавить();
	СтрокаТоваров.Номенклатура		= Справочники.Номенклатура.Предоплата;
	СтрокаТоваров.Количество		= 1;
	СтрокаТоваров.ЕдиницаИзмерения	= СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения;
	СтрокаТоваров.Коэффициент		= СтрокаТоваров.ЕдиницаИзмерения.Коэффициент;
	СтрокаТоваров.СтавкаНДС			= ДанныеЗаполнения.СтавкаНДС;
	СтрокаТоваров.СуммаВсего		= ДанныеЗаполнения.СуммаДокумента;
	Документы.СчетФактураПолученный.ТоварыСуммаВсегоПриИзменении(ЭтотОбъект, СтрокаТоваров, ДополнительныеСвойства.ПараметрыДействия);
	СуммаДокумента    				= Товары.Итог("СуммаВсего");
	СуммаНДСДокумента 				= Товары.Итог("СуммаНДС");
	СтрокаТоваров.СуммаНДС 			= ДанныеЗаполнения.СуммаНДС;
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_РасходныйКассовыйОрдер()

// Производит заполнение объекта на основании документа "Отчет комитенту".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ОтчетКомитенту(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения,
																				СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Товары.Очистить();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание",	ДанныеЗаполнения);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетКомитентуТовары.Номенклатура,
	|	СУММА(ОтчетКомитентуТовары.Количество) КАК Количество,
	|	СУММА(ОтчетКомитентуТовары.СуммаВсего) КАК Сумма,
	|	ОтчетКомитентуТовары.СтавкаНДС,
	|	СУММА(ОтчетКомитентуТовары.СуммаВсего) КАК СуммаОсталось,
	|	СУММА(ОтчетКомитентуТовары.Количество) КАК КоличествоОсталось,
	|	СУММА(ОтчетКомитентуТовары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ОтчетКомитентуТовары.СуммаНДС) КАК СуммаНДСОсталось,
	|	ОтчетКомитентуТовары.ХарактеристикаНоменклатуры,
	|	ОтчетКомитентуТовары.ГТД
	|ИЗ
	|	Документ.ОтчетКомитенту.Товары КАК ОтчетКомитентуТовары
	|ГДЕ
	|	ОтчетКомитентуТовары.Ссылка = &Основание
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетКомитентуТовары.Номенклатура,
	|	ОтчетКомитентуТовары.СтавкаНДС,
	|	ОтчетКомитентуТовары.ХарактеристикаНоменклатуры,
	|	ОтчетКомитентуТовары.ГТД";
	ТабТоваров = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализованныеТовары.Номенклатура,
	|	РеализованныеТовары.ХарактеристикаНоменклатуры,
	|	РеализованныеТовары.ГТД,
	|	СУММА(РеализованныеТовары.Количество) КАК Количество,
	|	СУММА(РеализованныеТовары.Количество) КАК КоличествоОсталось
	|ИЗ
	|	РегистрНакопления.РеализованныеТовары КАК РеализованныеТовары
	|ГДЕ
	|	РеализованныеТовары.Регистратор = &Основание
	|	И РеализованныеТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализованныеТовары.ГТД,
	|	РеализованныеТовары.ХарактеристикаНоменклатуры,
	|	РеализованныеТовары.Номенклатура";
	
	ТабГТД = Запрос.Выполнить().Выгрузить();
	
	Если ЗначениеЗаполнено(ТабТоваров) Тогда
		Документы.СчетФактураПолученный.ЗаполнитьДаннымОтчетаКомитента(ЭтотОбъект, ТабТоваров, ТабГТД);
	КонецЕсли;
	
	// Подсчет новой суммы документа назначения.
	СуммаДокумента    = Товары.Итог("СуммаВсего");
	СуммаНДСДокумента = Товары.Итог("СуммаНДС");
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ОтчетКомитенту()

// Производит заполнение объекта на основании документа "Возврат от покупателя".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ВозвратОтПокупателя(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Товары.Очистить();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание",	ДанныеЗаполнения);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратОтПокупателяТовары.Номенклатура,
	|	СУММА(ВозвратОтПокупателяТовары.Количество) КАК Количество,
	|	СУММА(ВозвратОтПокупателяТовары.СуммаВсего) КАК Сумма,
	|	ВозвратОтПокупателяТовары.СтавкаНДС,
	|	СУММА(ВозвратОтПокупателяТовары.СуммаВсего) КАК СуммаОсталось,
	|	СУММА(ВозвратОтПокупателяТовары.Количество) КАК КоличествоОсталось,
	|	СУММА(ВозвратОтПокупателяТовары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВозвратОтПокупателяТовары.СуммаНДС) КАК СуммаНДСОсталось,
	|	ВозвратОтПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ВозвратОтПокупателяТовары.ГТД
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Товары КАК ВозвратОтПокупателяТовары
	|ГДЕ
	|	ВозвратОтПокупателяТовары.Ссылка = &Основание
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратОтПокупателяТовары.Номенклатура,
	|	ВозвратОтПокупателяТовары.СтавкаНДС,
	|	ВозвратОтПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ВозвратОтПокупателяТовары.ГТД";
	ТабТоваров = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГТДПартийТоваровКомпании.Номенклатура,
	|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ГТДПартийТоваровКомпании.ГТД,
	|	СУММА(-ГТДПартийТоваровКомпании.Количество) КАК КоличествоОсталось,
	|	СУММА(-ГТДПартийТоваровКомпании.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.ГТДПартийТоваровКомпании КАК ГТДПартийТоваровКомпании
	|ГДЕ
	|	ГТДПартийТоваровКомпании.Регистратор = &Основание
	|
	|СГРУППИРОВАТЬ ПО
	|	ГТДПартийТоваровКомпании.Номенклатура,
	|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ГТДПартийТоваровКомпании.ГТД";
	
	ТабГТД = Запрос.Выполнить().Выгрузить();
	
	Если ЗначениеЗаполнено(ТабТоваров) Тогда
		Документы.СчетФактураПолученный.ЗаполнитьДаннымОтчетаКомитента(ЭтотОбъект, ТабТоваров, ТабГТД);
	КонецЕсли;
	
	// Подсчет новой суммы документа назначения.
	СуммаДокумента    = Товары.Итог("СуммаВсего");
	СуммаНДСДокумента = Товары.Итог("СуммаНДС");
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ВозвратОтПокупателя()

// Производит заполнение объекта на основании документа "Корректировка поступления".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_КорректировкаПоступления(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ЭтоИсправление = (ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияИсправлениеВПервичныхДокументах);
	ЕстьКорректировка = Ложь;
	Корректировка     = Неопределено;
	ОригиналОснование = Неопределено;
	ПервоеИсправление = Неопределено;
	
	// Получим документ оригинал и корректировку.
	Попытка
		ДокДокументОснование = ДанныеЗаполнения.ДокументОснование;
	Исключение
		ДокДокументОснование = Неопределено;
	КонецПопытки;
	
	Пока Истина Цикл
		Если ДокДокументОснование = Неопределено Тогда
			Прервать;
		КонецЕсли;
		Если ДокДокументОснование.ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияКорректировкаПоСогласованиюСторон Тогда
			ЕстьКорректировка = Истина;
			Корректировка = ДокДокументОснование;
		КонецЕсли;
		Если ДокДокументОснование.ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияИсправлениеВПервичныхДокументах 
			И ПервоеИсправление = Неопределено Тогда
			
			ПервоеИсправление = ДокДокументОснование;
			ЕстьИсправление = Истина;
		КонецЕсли;
		Если ТипЗнч(ДокДокументОснование) <> Тип("ДокументСсылка.КорректировкаПоступления") Тогда
			ОригиналОснование = ДокДокументОснование;
			Прервать;
		КонецЕсли;
		ДокДокументОснование = ДокДокументОснование.ДокументОснование;
	КонецЦикла;
	
	ЕстьОснование = (ОригиналОснование <> Неопределено);
	// Получим счет фактуру для документов.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактураПолученный.Ссылка,
	|	СчетФактураПолученный.ДокументОснование
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.ДокументОснование В (&Док)";
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(Корректировка);
	МассивДокументов.Добавить(ОригиналОснование);
	МассивДокументов.Добавить(ПервоеИсправление);
	Запрос.УстановитьПараметр("Док",МассивДокументов);
	
	ТаблСФ = Запрос.Выполнить().Выгрузить();
	
	Исправление = ЭтоИсправление;
	Если ЭтоИсправление Тогда
		Если ПервоеИсправление = Неопределено Тогда
			НомерИсправления = 1;
			УчитыватьИсправлениеИсходногоДокумента = Ложь;
		Иначе
			МассивСФ = ТаблСФ.НайтиСтроки(Новый Структура("ДокументОснование",ПервоеИсправление));
			Если МассивСФ.Количество() = 0 Тогда
				Если ЭтоИсправление Тогда
					НомерИсправления = 1;
				Иначе
					НомерИсправления = 0;
				КонецЕсли;
				УчитыватьИсправлениеИсходногоДокумента = Истина;
			Иначе
				УчитыватьИсправлениеИсходногоДокумента = Истина;
				НомерИсправленияИсходногоДокумента = ?(НЕ ЗначениеЗаполнено(МассивСФ[0].Ссылка.ВхДокНомер),
															МассивСФ[0].Ссылка.НомерИсправления,МассивСФ[0].Ссылка.ВхДокНомер);
				ДатаИсправленияИсходногоДокумента = ?(НЕ ЗначениеЗаполнено(МассивСФ[0].Ссылка.ВхДокДата),
															МассивСФ[0].Ссылка.Дата,МассивСФ[0].Ссылка.ВхДокДата);
				НомерИсправления = МассивСФ[0].Ссылка.НомерИсправления + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЕстьКорректировка Тогда
		МассивСФ = ТаблСФ.НайтиСтроки(Новый Структура("ДокументОснование",Корректировка));
		Если МассивСФ.Количество() > 0 Тогда
			НомерИсправляемогоКорректировочногоДокумента = ?(НЕ ЗначениеЗаполнено(МассивСФ[0].Ссылка.ВхДокНомер),
																МассивСФ[0].Ссылка.Номер,МассивСФ[0].Ссылка.ВхДокНомер);
			ДатаИсправляемогоКорректировочногоДокумента  = ?(НЕ ЗначениеЗаполнено(МассивСФ[0].Ссылка.ВхДокДата),
																МассивСФ[0].Ссылка.Дата,МассивСФ[0].Ссылка.ВхДокДата);
		КонецЕсли;
	КонецЕсли;
	
	Если ОригиналОснование <> Неопределено Тогда
		МассивСФ = ТаблСФ.НайтиСтроки(Новый Структура("ДокументОснование",ОригиналОснование));
		Если МассивСФ.Количество() > 0 Тогда
			НомерИсходногоДокумента = ?(НЕ ЗначениеЗаполнено(МассивСФ[0].Ссылка.ВхДокНомер),
											МассивСФ[0].Ссылка.Номер,МассивСФ[0].Ссылка.ВхДокНомер);
			ДатаИсходногоДокумента  = ?(НЕ ЗначениеЗаполнено(МассивСФ[0].Ссылка.ВхДокДата),
											МассивСФ[0].Ссылка.Дата,МассивСФ[0].Ссылка.ВхДокДата);
		КонецЕсли;
	КонецЕсли;
	
	ХозОперация = Справочники.ХозОперации.СчетФактураПолученныйКорректировка;
	Товары.Очистить();
	
	Для Каждого стрОснования Из ДанныеЗаполнения.Товары Цикл
		Если стрОснования.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если стрОснования.Подтверждение = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), стрОснования);
	КонецЦикла;
	
	// Закроем дальнейшее заполнение.
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Выписка()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА)
	
	// Получим список уже введенных счетов-фактур.
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("ДокументСсылка.Выписка") Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПодчиненныеДокументы.Ссылка КАК Документ
		|ИЗ
		|	КритерийОтбора.ПодчиненныеДокументы(&Основание) КАК ПодчиненныеДокументы
		|ГДЕ
		|	ПодчиненныеДокументы.Ссылка ССЫЛКА Документ.СчетФактураПолученный";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Основание",ДанныеЗаполнения);
		Выборка = Запрос.Выполнить().Выгрузить();
		
		НовыйДокумент = Истина;
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			НовыйДокумент = ?(ЗначениеЗаполнено(Выборка.Найти(Ссылка, "Документ")), Ложь, Истина);
		КонецЕсли;
	
		Если Выборка.Количество() > 0 И НовыйДокумент Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='На основании документа <%1> уже введен <%2>.'"),ДанныеЗаполнения,Выборка[0].Документ);
			УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(Выборка[0].Документ, ТекстСообщения);
			Возврат;	
		КонецЕсли;
		
	КонецЕсли;

	// Вызываем общий обработчик события.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "ВхДокНомер,ВхДокДатаВрем,АкцептованБухгалтером") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполненНаОснованииДокумента = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеСвойства, "ВыполненоЗаполнениеНаОсновании", "");
	Если НЕ (ЗаполненНаОснованииДокумента = "Выписка" 
		ИЛИ ЗаполненНаОснованииДокумента = "ОтчетКомиссионера" 
		ИЛИ ЗаполненНаОснованииДокумента = "РасходныйКассовыйОрдер"
		ИЛИ ЗаполненНаОснованииДокумента = "ОтчетКомитенту" 
		ИЛИ ЗаполненНаОснованииДокумента = "ВозвратОтПокупателя") Тогда
		
		Если Товары.Количество() > 0 Тогда
			СуммаДокумента    = Товары.Итог("СуммаВсего");
			СуммаНДСДокумента = Товары.Итог("СуммаНДС");
		КонецЕсли; 
	КонецЕсли;
	
	Грузоотправитель	= Контрагент;
	
	// Если вводим на основании поступления товаров, то удалим в случае наличия строки с 0-м количеством.
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		Сч = 0;
		Пока Сч < Товары.Количество() Цикл
			Если Товары[Сч].Количество = 0 Тогда
				Товары.Удалить(Сч);
			Иначе
				Сч = Сч + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ИдентификаторГосударственногоКонтракта = ?(ЗначениеЗаполнено(ИдентификаторГосударственногоКонтракта),
		ИдентификаторГосударственногоКонтракта,
		ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события.
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события.
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события.
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события.
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()


#Область Инициализация

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// Установим параметры проверки документа.
ДополнительныеСвойства.Вставить("ТоварыЗапретАвтоСписанияХарактеристик", ИСТИНА);

#КонецОбласти

#КонецЕсли
